ab_test
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /ping
Document Length:        58 bytes

Concurrency Level:      10
Time taken for tests:   1.999 seconds
Complete requests:      5000
Failed requests:        0
Non-2xx responses:      5000
Total transferred:      960000 bytes
HTML transferred:       290000 bytes
Requests per second:    2501.70 [#/sec] (mean)
Time per request:       3.997 [ms] (mean)
Time per request:       0.400 [ms] (mean, across all concurrent requests)
Transfer rate:          469.07 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       8
Processing:     1    4   2.1      3      31
Waiting:        0    3   2.0      3      22
Total:          1    4   2.2      4      31

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      4
  75%      5
  80%      5
  90%      6
  95%      8
  98%     10
  99%     13
 100%     31 (longest request)